<details ><summary>Digger run report at 2025-10-08 18:54:40 (UTC)</summary>
              <details ><summary>Apply output</summary>

```terraform

```
</details>

<details ><summary>Error during applying.</summary>
  exit status 1
</details>


<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.dev_config will be created
  + resource "aws_ssm_parameter" "dev_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for dev environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/dev/config"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.prod_config will be created
  + resource "aws_ssm_parameter" "prod_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for prod environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/prod/config"
      + tags           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qa_config will be created
  + resource "aws_ssm_parameter" "qa_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for qa environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/qa/config"
      + tags           = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shared_config will be created
  + resource "aws_ssm_parameter" "shared_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for shared environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/shared/config"
      + tags           = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # null_resource.dev will be destroyed
  # (because null_resource.dev is not in configuration)
  - resource "null_resource" "dev" {
      - id = "1325833302524151943" -> null
    }

  # null_resource.prod will be destroyed
  # (because null_resource.prod is not in configuration)
  - resource "null_resource" "prod" {
      - id = "5105306259574484762" -> null
    }

  # null_resource.qa will be destroyed
  # (because null_resource.qa is not in configuration)
  - resource "null_resource" "qa" {
      - id = "3433261662205872602" -> null
    }

  # null_resource.shared will be destroyed
  # (because null_resource.shared is not in configuration)
  - resource "null_resource" "shared" {
      - id = "378608383326125785" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.
null_resource.prod: Destroying... [id=5105306259574484762]
null_resource.shared: Destroying... [id=378608383326125785]
null_resource.qa: Destroying... [id=3433261662205872602]
null_resource.shared: Destruction complete after 0s
null_resource.dev: Destroying... [id=1325833302524151943]
null_resource.qa: Destruction complete after 0s
null_resource.prod: Destruction complete after 0s
null_resource.dev: Destruction complete after 0s
aws_ssm_parameter.shared_config: Creating...
aws_ssm_parameter.qa_config: Creating...
aws_ssm_parameter.prod_config: Creating...
aws_ssm_parameter.dev_config: Creating...
aws_ssm_parameter.shared_config: Creation complete after 1s [id=/k8s_deployment/shared/config]
aws_ssm_parameter.prod_config: Creation complete after 1s [id=/k8s_deployment/prod/config]
aws_ssm_parameter.dev_config: Creation complete after 1s [id=/k8s_deployment/dev/config]
aws_ssm_parameter.qa_config: Creation complete after 1s [id=/k8s_deployment/qa/config]

Apply complete! Resources: 4 added, 0 changed, 4 destroyed.

```
</details>


<details ><summary>Apply output</summary>

```terraform

```
</details>


<details ><summary>Error during applying.</summary>
  exit status 1
</details>


<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.dev_config will be created
  + resource "aws_ssm_parameter" "dev_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for dev environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/dev/config"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.prod_config will be created
  + resource "aws_ssm_parameter" "prod_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for prod environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/prod/config"
      + tags           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qa_config will be created
  + resource "aws_ssm_parameter" "qa_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for qa environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/qa/config"
      + tags           = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shared_config will be created
  + resource "aws_ssm_parameter" "shared_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for shared environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/shared/config"
      + tags           = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # null_resource.dev will be destroyed
  # (because null_resource.dev is not in configuration)
  - resource "null_resource" "dev" {
      - id = "4258326423801149508" -> null
    }

  # null_resource.prod will be destroyed
  # (because null_resource.prod is not in configuration)
  - resource "null_resource" "prod" {
      - id = "5790445156167865581" -> null
    }

  # null_resource.qa will be destroyed
  # (because null_resource.qa is not in configuration)
  - resource "null_resource" "qa" {
      - id = "9020765786532430695" -> null
    }

  # null_resource.shared will be destroyed
  # (because null_resource.shared is not in configuration)
  - resource "null_resource" "shared" {
      - id = "2099058177563623054" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.
null_resource.shared: Destroying... [id=2099058177563623054]
null_resource.qa: Destroying... [id=9020765786532430695]
null_resource.prod: Destroying... [id=5790445156167865581]
null_resource.dev: Destroying... [id=4258326423801149508]
null_resource.dev: Destruction complete after 0s
null_resource.shared: Destruction complete after 0s
null_resource.qa: Destruction complete after 0s
null_resource.prod: Destruction complete after 0s
aws_ssm_parameter.dev_config: Creating...
aws_ssm_parameter.qa_config: Creating...
aws_ssm_parameter.prod_config: Creating...
aws_ssm_parameter.shared_config: Creating...

```
</details>


<details ><summary>Error during applying.</summary>
  exit status 1
</details>

</details>